## Aufgaben zu Pandas

### Verwendete Bibliotheken

In [1]:
import pandas as pd
import numpy as np

### 1. Beispiele zu DataFrame erzeugen

Erzeugen Sie nachfolgende Tabelle, indem Sie ein festes Dictionary verwenden!

In [1]:
import pandas as pd
pd.DataFrame({'col1': [100, 200], 'col2': [300, 400]})

   col1  col2
0   100   300
1   200   400

Erzeugen Sie einen großen DataFrame mit der  Funktion „random.rand()“ von NumPy mit 4 Zeilen und 8 Spalten als  feste Parameter

In [4]:
import pandas as pd
import numpy as np
pd.DataFrame(np.random.rand(4, 8).round(4))

        0       1       2       3       4       5       6       7
0  0.6858  0.9298  0.9682  0.7612  0.7452  0.5391  0.1774  0.0822
1  0.5487  0.6258  0.1012  0.1910  0.8491  0.0575  0.9355  0.6594
2  0.0992  0.2425  0.9520  0.5397  0.3988  0.2499  0.4934  0.5811
3  0.1237  0.6728  0.2162  0.7915  0.0432  0.6643  0.5477  0.1976

Benennen Sie die Spalten mit a bis h und verwenden Sie eine Liste als Parameter: 
list('abcdefgh')

In [24]:
import pandas as pd
import numpy as np
table = pd.DataFrame(np.random.rand(4, 8).round(4))
table.columns = list('abcdefgh')
table

        a       b       c       d       e       f       g       h
0  0.7980  0.6680  0.0064  0.9728  0.3618  0.5082  0.4438  0.0035
1  0.8195  0.9836  0.1871  0.6562  0.1697  0.2906  0.7662  0.5010
2  0.5666  0.5443  0.6996  0.6760  0.7403  0.2630  0.2332  0.0872
3  0.5395  0.8132  0.7697  0.1152  0.9525  0.6640  0.4533  0.2803

### 2. Umbenennen von Spalten

Verwenden Sie folgende Tabelle von oben:
df = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]})
Ändern sie die Namen der Spalten durch direkte Zuweisung in 'col_one', 'col_two' ab!

In [25]:
import pandas as pd
table = pd.DataFrame({'col1': [100, 200], 'col2': [300, 400]})
table.rename(columns={'col1': 'col_one', 'col2': 'col_two'}, inplace=True)
table

   col_one  col_two
0      100      300
1      200      400

Fügen Sie einen Prefix allen Spalten hinzu z.B. "X_"!

In [61]:
import pandas as pd

table = pd.DataFrame({'col1': [100, 200], 'col2': [300, 400]})
table.rename(columns={'col1': 'col_one', 'col2': 'col_two'}, inplace=True)
table = table.add_prefix('X_')
table

   X_col_one  X_col_two
0        100        300
1        200        400

Fügen Sie einen suffix allen Spalten hinzu z.B. "_Y"!

In [62]:
import pandas as pd

table = pd.DataFrame({'col1': [100, 200], 'col2': [300, 400]})
table.rename(columns={'col1': 'col_one', 'col2': 'col_two'}, inplace=True)
table = table.add_suffix('_Y')
table

   col_one_Y  col_two_Y
0        100        300
1        200        400

### 3. Zeilenreihenfolge umkehren

Laden Sie die Datei drinks.csv aus dem Verzeichnis data und lassen Sie die ersten 10 Datensätze darstellen:

In [8]:
import pandas as pd

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

Kehren Sie die Reihenfolge des Datasets um(Sortierung Z bis A bei country), indem Sie `loc` mit dem Parameter `::-1` verwenden!

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

Kehren Sie den Index mit Hilfe der Funktion `reset_index()` method! Beachten Sie den Parameter "drop"!

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

### 4.  Spaltenreihenfolge umkehren

Erklären Sie, warum Sie mit [:, ::-1] als Parameter von loc die Spaltenreihenfolge umkehren können und testen Sie dies aus!

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

The colon before the comma means "select all rows", and the `::-1` after the comma means "reverse the columns", which is why "country" is now on the right side.

## 5. Spalten & Datentypen

Lassen Sie sich alle Datentypen der Datei drinks.csv anzeigen!

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

Speichern Sie alle numerischen Spalten in dfDrinksNumberCols unterVerwendung von `select_dtypes()` und lassen Sie die ersten 3 Zeilen anzeigen:

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7

Speichern Sie alle Spalten mit Typ 'object' in dfDrinksObjectsCols unterVerwendung von `select_dtypes()` und lassen Sie die ersten 3 Zeilen anzeigen:

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7

Verwenden sie nun als Parameter eine Liste um Datentypspalten vom numerische oder object in dfDrinksNumberOrObjectCols zu kopieren!

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

Speichern Sie alle numerischen Spalten in dfDrinksNumberExceptCols unter Verwendung von `select_dtypes()` und lassen Sie die ersten 3 Zeilen anzeigen:

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

### 6. Konvertierung von Strings nach Numbers

Für die nächsten Teilaufgaben wird folgendes Dataframe verwendet:

In [17]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

Geben Sie die Datentypen der Tabelle aus und lesen Sie ab, dass die Spalten als Datentyp string eingelesen werden!

col_one      object
col_two      object
col_three    object
dtype: object

Wir möchten damit rechnen und den Datentyp in den ersten beiden Spalten nach df2ColsFloat konverieren. Verwenden Sie `astype()` auf die ersten beiden Spalten! Warum funktioniert dies mit der 3. Spalte nicht?

col_one      float64
col_two      float64
col_three     object
dtype: object

Ein sicheres Verfahren ist die Pandas funktion `to_numeric()`, die mit dem  Parameter errors='coerce' Fehler unterdrückt:
"df.apply(pd.to_numeric, errors='coerce')" und ungültige Daten auf NaN setzt!
Anschließend kann man mit der fillNa() methode diese NaN Werte z.B. auf 0 setzen!
Geben Sie anschliesend die Daten und die Datentypen aus!

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0
col_one      float64
col_two      float64
col_three    float64
dtype: object

### 7. Reduktion der Größe der DataFrames

Erstellen Sie eine Funktion createBigData(noOfRows), welche zufällige Datensätze erstellt!<br>
Die Funktion soll einen DataFrame zurückgeben, der folgende Spalten enthält:<br>

position: Eine zufällige Auswahl aus den Werten 'left', 'middle' und 'right'.<br>
age: Zufällige Ganzzahlen im Bereich von 1 bis 50, die das Alter darstellen.<br>
team: Eine zufällige Auswahl aus den Werten 'red', 'blue', 'yellow' und 'green'.<br>
win: Eine zufällige Auswahl aus den Werten 'yes' und 'no', um anzuzeigen, ob das Team gewonnen hat.<br>
prob: Zufällige Gleitkommazahlen im Bereich von 0 bis 1, die die Wahrscheinlichkeit eines Ereignisses darstellen<br>
Testen Sie die Funktion mit 1_000_000!<br>
testen Sie das Ergebnis mit df.shape und df.info()!

Optimieren Sie die Spaltenformatierung:<br>
- Legen Sie für die position- und team-Spalten den Datentyp 'category' fest.
- Reduzieren Sie den Speicherbedarf, indem Sie die age-Spalte auf den Datentyp 'int8' und die prob-Spalte auf den Datentyp 'float32' umwandeln.
- Konvertieren Sie die win-Spalte in einen booleschen Datentyp, indem Sie den Wert 'yes' in True und den Wert 'no' in False umwandeln.
- Vergleichen Sie das Ergebnis vorher und hinterher mit info()!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 5 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   position  1000000 non-null  object
 1   age       1000000 non-null  int32
 2   team      1000000 non-null  object
 3   win       1000000 non-null  object
 4   prob      1000000 non-null  float64
dtypes: float64(1), int32(1), object(3)
memory usage: 34.3+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 5 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   position  1000000 non-null  category
 1   age       1000000 non-null  int8
 2   team      1000000 non-null  category
 3   win       1000000 non-null  bool
 4   prob      1000000 non-null  float32
dtypes: bool(1), category(2), float32(1), int8(1)
memory usage: 7.6 MB

Testen Sie die Abfragegeschwindigkeit vorher und hinterher mit:
 - %timeit df['age_rank'] = df.groupby(['team', 'position'])['age'].rank()

<magic-timeit>:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
<magic-timeit>:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.

1.54 s ± 305 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

### 8. Filtern von DataFrames

Lesen Sie die Datei movies.csv in die Variable dfMovies ein und zeigen Sie die ersten 10 Datensätze an!

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
8,8.9,Schindler's List,R,Biography,195,"[u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."

Welche Arten von Filmen gibt es in der Tabelle? Zeigen Sie alle an(natürlich ohne Dubletten; Hinweis: 'unique()' auf die Spaltenselektion anwenden!)

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

Filtern Sie die Datenbank auf die Genres Action oder Drama oder Western!
Kodieren Sie die Variante mit dem Union Operator '|'!

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

Filtern Sie die Datenbank auf die Genres Action oder Drama oder Western!
Kodieren Sie die Variante mit der isin Methode!

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

Zeigen Sie alle an, die NICHT in diesen drei Genres sind! Um die Negierung der Bedinung zu erreichen, "excluding" schreibt man eine Tilde vor die Bedingung!

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."

### 9. Filtern eines DataFrames mit den größten/kleinsten Kategorien

Ermitteln Sie die Anzahl der Einträge für jenes Genre!
- Wenden Sie die Funktion  `value_counts()` auf genre an!
- Geben Sie das Ergebnis aus! 
- Ermitteln Sie den Typ des Rückgabewertes!

pandas.core.series.Series

Verwenden Sie die Funktion `nlargest()` um die 3 am meisten vorkommenden Genre zu ermitteln und speichern Sie das Ergebnis in countGenreTop3 ab!

genre
Drama     278
Comedy    156
Action    136
Name: count, dtype: int64

Wie bekommt man von dieser Serie die 1. und 2. Spalte?

Index(['Drama', 'Comedy', 'Action'], dtype='object', name='genre')
[278 156 136]

Verwenden Sie die Werte der 2.Spalte in Kombination mit `isin()` um alle Datensätze der ursprünglichen Liste mit diesen 3 Genres zu bekommen und auszugeben! Erstellen Sie ein DataFrame dfTop3GenreAllData!

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

### 10. Behandeln von fehlenden Werten

Laden Sie die Datei ufos.csv mit dem Parameter parse_dates=['Time'] in dfUfos! Welche Funktion hat er?
Hinweis: Laden Sie die Datei in ein zweites DF und vergleichen Sie die Eigenschaften mit der Methode info()!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 712.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18215 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

Wir wollen feststellen, wie viele Werte in jeder Spalte fehlen! Wenden Sie die Funktion `isna()` an und anschließend  `sum()`!
`isna()` generiert ein DF von True and Falst und `sum()` convertiert alle True Werte zu 1 und summiert diese auf!

City                  26
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

Finden Sie analog die Mittelwerte für fehlende Werte in jeder Spalte!

City               0.001425
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

Wir wollen vollständige Datensätze! Verwenden Sie die Funktion drophna(), um alle unvollständigen Datensätze zu löschen, wo eine Spalte einen "na"-Eintrag hat und in dfUfosComplete zu speichern!

  State                Time
0    NY 1930-06-01 22:00:00
1    NJ 1930-06-30 20:00:00
2    CO 1931-02-15 14:00:00
3    KS 1931-06-01 13:00:00
4    NY 1933-04-18 19:00:00

Wenn Sie Spalten löschen möchten, in denen mehr als 10% der Werte fehlen, können Sie einen Schwellenwert für dropna() festlegen, verwenden Sie den Parameter thresh!

'len(ufo)' gibt die Gesamtzahl der Zeilen zurück, und dann multiplizieren wir das mit 0,9, um pandas mitzuteilen, nur Spalten beizubehalten, in denen mindestens 90% der Werte nicht fehlen.

                   City State                Time
0                Ithaca    NY 1930-06-01 22:00:00
1           Willingboro    NJ 1930-06-30 20:00:00
2               Holyoke    CO 1931-02-15 14:00:00
3               Abilene    KS 1931-06-01 13:00:00
4  New York Worlds Fair    NY 1933-04-18 19:00:00

## 11. Aggregation

Lesen Sie die Tabulator separierte Datei "orders.txt" ein!

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
6,3,1,Side of Chips,NaN,1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",9.25

Jede Bestellung hat eine Bestellnummer (order_id) und besteht aus einer oder mehreren Zeilen. Um den Gesamtpreis einer Bestellung zu ermitteln, addieren Sie die Artikelkosten für diese Bestellnummer. Zum Beispiel berechnen Sie hier der Gesamtpreis der Bestellung Nummer 1!
Hinweis: Filter auf order_id=1 setzen und mit der Methode sum() summieren!

0    2.39
1    3.39
2    3.39
3    2.39
Name: item_price, dtype: float64

11.56

Wenn Sie den Gesamtpreis jeder Bestellung berechnen möchten, würden Sie groupby() nach order_id durchführen und dann die Summe von item_price für jede Gruppe nehmen:

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

"Sie sind jedoch nicht darauf beschränkt, nur eine Funktion wie sum() zu aggregieren. Um nach mehreren Funktionen zu aggregieren, verwenden Sie die Methode agg() und übergeben ihr eine Liste von Funktionen wie sum() und count():"

            sum  count
order_id
1         11.56      4
2         16.98      1
3         12.67      2
4         21.00      2
5         13.70      2

### 12. Wählen Sie einen Ausschnitt von Zeilen und Spalten aus

Laden Sie die Datei Titanic.csv!

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Dies ist der berühmte Titanic-Datensatz, der Informationen über Passagiere auf der Titanic und darüber, ob sie überlebt haben oder nicht, zeigt.
Wenn Sie eine numerische Zusammenfassung des Datensatzes möchten, würden Sie die describe()-Methode verwenden!

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Allerdings zeigt das resultierende DataFrame möglicherweise mehr Informationen, als Sie benötigen.

Wenn Sie es filtern möchten, um nur die "Fünf-Nummern-Zusammenfassung" anzuzeigen, können Sie den loc-Zugriffsoperator verwenden und ihm einen Ausschnitt der Zeilenbezeichnungen von "min" bis "max" übergeben: loc['min':'max']

     PassengerId  Survived  Pclass     Age  SibSp  Parch      Fare
min          1.0       0.0     1.0   0.420    0.0    0.0    0.0000
25%        223.5       0.0     2.0  20.125    0.0    0.0    7.9104
50%        446.0       0.0     3.0  28.000    0.0    0.0   14.4542
75%        668.5       1.0     3.0  38.000    1.0    0.0   31.0000
max        891.0       1.0     3.0  80.000    8.0    6.0  512.3292

Wenn Sie jedoch nicht an allen Spalten interessiert sind, können Sie ihm auch einen Ausschnitt von Spaltenbezeichnungen übergeben! Zeigen Sie nur die Spalten Pclass bis Parch an!

     Pclass     Age  SibSp  Parch
min     1.0   0.420    0.0    0.0
25%     2.0  20.125    0.0    0.0
50%     3.0  28.000    0.0    0.0
75%     3.0  38.000    1.0    0.0
max     3.0  80.000    8.0    6.0

### 13. Kontinuierliche Daten(Zahlen) in kategoriale Daten(Kategorien) umwandeln

Geben Sie die ersten 10 Datensätze der Spalte age aus!

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

Mit der cut() Funktion von Pandas machen Sie folgendes: Die Funktion teilt die Altersdaten in verschiedene Altersgruppen ein, die durch die Grenzen definiert sind, die als bins-Parameter angegeben werden. Diese Grenzen sollten so gewählt werden, dass sie verschiedene Altersgruppen repräsentieren, wie z.B. "Kind", "junge Erwachsene" und "Erwachsene". Die entsprechenden Beschriftungen für diese Gruppen werden als labels-Parameter übergeben.

Wandeln Sie die Altersdaten aus dem Titanic-Datensatz in kategoriale Daten umwandelt, wobei die Grenzen für "Kind" (0-17 Jahre), "junge Erwachsene" (18-24 Jahre) und "Erwachsene" (25-99 Jahre) definiert sind!

0    young adult
1          adult
2          adult
3          adult
4          adult
5            NaN
6          adult
7          child
8          adult
9          child
Name: Age, dtype: category
Categories (3, object): ['child' < 'young adult' < 'adult']

### 14. DataFrame formatieren - Dezimalstellen

Geben Sie die Daten nach Verwendung der `set_option()` function

pd.set_option('display.float_format', '{:.2f}'.format)

an und beschreiben Sie die Wirkung!

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.92,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.05,NaN,S

Setzen Sie die Einstellung wieder zurück und zeigen Sie die ersten 10 Datensätze an!

Experimentieren Sie mit den Einstellungen und finden Sie eine bessere Darstellung als das Alter z.B. mit 2 Dezimalstellen darzustellen!
Der Trick ist nützlich, wenn Sie die Darstellung Ihres gesamten Notebooks ändern möchten. Allerdings ist ein flexiblerer und leistungsstärkerer Ansatz, den Stil eines bestimmten DataFrames zu definieren wie im nächsten Teil!

## 15. DataFrame formatieren - Farben

Laden Sie die Datendatei stock.csv mit dem Parameter parse_dates=['Date'] und beschreiben Sie den Unterschied ohne Parameter!

Hinweis: In zwei Code-Bereichen in verschiede DataFrames laden und mit info() vergleichen!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    9 non-null      object
 1   Close   9 non-null      float64
 2   Volume  9 non-null      int64
 3   Symbol  9 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 420.0+ bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    9 non-null      datetime64[ns]
 1   Close   9 non-null      float64
 2   Volume  9 non-null      int64
 3   Symbol  9 non-null      object
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 420.0+ bytes

Erstellen Sie ein Dictionary, mit dem Sie die Ausgabe dieses DataFrames(nicht aller, Unterschied zu eben!) formatieren!<br>
Füllen Sie dazu die Strings '' in nachfolgendem Befehl aus, und ersetzen Sie ??? mit einer Formatierung!<br>
formatDfStocks = {'Date':'???', 'Close':'???', 'Volume':'???'}<br>
Date: Darstellung als Monat, Tag, Jahr<br>
Close: Zwei Dezimalstellen und das Währungssymbol $ vor der Zahl!<br>
Volume: keine Formatierung der Dezimalstellen, aber Komma(,) als 1000-er Zeichen:<br>
Verwenden Sie die DataFrame `style.format()` Methode zur Ausgabe!<br>
Anschließend geben Sie nur die ersten 3 Zeilen aus!

Fügen Sie noch weitere Formatierungen hinzu:<br>
- Minimaler Close-Wert Hintergrund lightgreen
- Maximaler Close-Wert Hintergrund red

Verwenden Sie die formatierte Darstellung der ersten Teilaufgabe und fügen Sie für die Spaltee Volume mit der Methode background_gradient und Farbe Blues eine Farbdarstellung hinzu!<br>
Beschreiben Sie die Bedeutung der Farben!

Nehmen Sie das Ergebnis der ersten Teilaufgabe!<br>
- Fügen Sie die Überschrift "Stock Prices beginnend Oktober 2016" hinzu!
- Stellen Sie die Größe der Werte der Spalte Volume im Hintergrund der Zellen dieser Spalte lightblue dar!